run/moorDynBoxInWaves/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
     box
    {
        type        floaterVelocity;
        slip        true;
        value       uniform (0 0 0);
    }
    
    wall1
    {
        type        empty;
    }
    wall2
    {
        type        empty;
    }
    inlet
    {
        type        waveVelocity;
        value       uniform ( 0 0 0 );
    }
    outlet
    {
        type        waveVelocity;
        value       uniform ( 0 0 0 );
    }
    atmosphere
    {
        type        pressureInletOutletVelocity;
        value       uniform (0 0 0);
    }
    bottom
    {
        type        noSlip;
    }
}


// ************************************************************************* //
